app/controllers/students_controller.rb

  def activate
    set_student
    if @student.active
      @student.update(active: 0)
---
UPDATE "students" SET "active" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["active", "t"], ["updated_at", "2018-03-17 19:24:55.649736"], ["id", 1]]